app/models/user.rb

  def reset_session_token!
    self.update!(session_token: SecureRandom.urlsafe_base64(16))
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "HmnCUPLhCgQoLAw16uWm-g"], ["updated_at", "2020-03-02 19:22:48.491250"], ["id", 11]]